#include <iostream>
using namespace std;
int umn(int a,int b) {
	return a*b;
	}

double umn(double a,double b) {
	return a*b;
	}
int umn(int a,int b,int c) {
	return a*b*c;
	}
int umn3 (int a,int b=1,int c=2) {
	return a*b*c;
	}
int main () {
	cout<<"1) "<<"произведение чисел 2 и 3 равно "<<umn(2,3)<<";"<<endl;
	cout<<"2) "<<"произведение чисел 0.5 и 3.2 равно "<<umn(0.5,3.2)<<";"<<endl;
	cout<<"3) "<<"произведение чисел 2, 3 и 5 равно "<<umn(2,3,5)<<";"<<endl;
	cout<<"4) "<<"произведение чисел 5, 1 и 2 равно "<<umn3(5)<<";"<<endl;
	cout<<"5) "<<"произведение чисел 5, 4 и 2 равно "<<umn3(5,4)<<";"<<endl;
	cout<<"6) "<<"произведение чисел 5,4 и -2 равно "<<umn3(5,4,-2)<<";"<<endl;
	}
///1) и 2) - перегрузка по типу данных при одинаковом количестве параметров;
///1) и 3) строки - перегрузка по количеству параметров;
///4), 5) и 6) - перегрузка с использованием параметров по умолчанию.

